export default function PrivacyPolicy() {
  return (
    <div className="prose dark:prose-invert prose-slate mx-auto max-w-4xl space-y-6 px-4 py-8">
      <h1 className="mb-8 text-3xl font-bold">「致唯MultiPost」隐私政策</h1>
      <p className="text-sm text-gray-500 dark:text-gray-400">最近更新时间：2024年4月28日</p>

      <div className="space-y-4">
        <div className="my-6 rounded-lg bg-blue-50 p-4 dark:bg-blue-900/20">
          <p className="leading-relaxed text-gray-600 dark:text-gray-300">
            致唯MultiPost非常重视用户的个人信息和隐私保护。致唯MultiPost（或称&quot;致唯&quot;&quot;我们&quot;&quot;本平台&quot;）的使命之一是向内容创作者与其受众提供科技服务和平台，协助他们在互动与连接上事半功倍。
          </p>
        </div>

        <h2 className="mb-4 mt-8 text-xl font-semibold text-gray-900 dark:text-gray-100">一、重要提示</h2>
        <p>
          由于服务内容、联络方式、法律和监管政策要求等变化，我们可能会适时对本隐私政策进行修订。当隐私政策发生变更时，我们会在我们的平台发布更新后的版本。若您继续使用我们的服务，即表示您充分阅读、理解并同意受经修订的本隐私政策的约束。如果您不同意，请您停止使用我们的产品或服务的任何部分或全部，如您继续使用我们的软件或服务，有必要对最新的隐私政策进行仔细阅读和重新确认，当发生相关争议时，以最新的隐私政策为准。
        </p>
        <p>
          1.1.
          我们深知个人信息对您的重要性。我们会严格按照相关法律法规及本隐私政策的规定收集、使用、储存、分享和管理您的个人信息。本隐私政策适用于我们向您提供的各项产品及服务。
        </p>
        <p>
          1.2.在使用我们的产品或服务前，请务必仔细阅读并充分理解本隐私政策。您通过登录页面点击确认、实际购买或使用致唯提供的产品或服务即表明您已阅读并充分理解本隐私政策之内容，并且已同意我们按照本隐私政策（含更新版本）收集、使用、分享、储存和管理您的相关信息。
        </p>
        <p>
          1.3.我们提供产品或服务的网络平台可能包含跳转至其他网站的链接或指引。请注意，我们不控制这些被跳转所至的网站，本隐私政策在任何情况下均不适用于这些网站。我们建议您在访问这些网站时仔细阅读他们的隐私政策。
        </p>
        <p>1.4. 如对本隐私政策内容有任何疑问、意见或建议，您可按照本隐私政策第十条显示的任一联系方式与我们联系。</p>
        <p>二、个人信息</p>
        <p>
          您的“个人信息”：是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息，包括自然人的基本资料、个人身份信息、个人生物识别信息、网络身份标识信息、个人财产信息、通讯录信息、个人上网记录、个人常用设备信息、个人位置信息。我们实际具体收集的个人信息种类以下文描述为准。
        </p>
        <p>三、我们如何收集您的个人信息</p>
        <p>
          在您使用我们产品或服务的过程中，我们仅会在非常必要的情况下和非常有限的限度内收集您的个人信息，并且这些信息仅用于向您提供产品或服务、优化我们的产品或服务，以及保障您的账号安全。具体而言，我们将按照如下方式收集您主动提供或因为使用服务而产生的信息：
        </p>
        <p>
          3.1.在您进行注册认证、发布信息、互动交流或使用我们的服务时，基于法律要求或实现功能所必需，我们可能会收集您的用户名、手机号等个人信息。除此之外，我们不会收集您的IMEI、IMSI、设备
          MAC 地址、软件安装列表、位置、联系人、通话记录、日历、短信、本机电话号码、图片、音视频等不必要的个人信息。
        </p>
        <p>
          3.2.
          若您通过第三方账号（如哔哩哔哩）登录进入平台，您此时将授权我们获取您在第三方平台注册的公开信息（用户ID、头像、昵称等），并在您同意本隐私政策后将您的第三方账号与您在平台的账号绑定，用于与本平台账号绑定、账号信息的完善、保障您的账号安全、防范安全风险。
        </p>
        <p>3.3. 本平台对匿名的、没有任何个人标识的信息和数据集享有完整的权益。</p>
        <p>
          3.4
          为了向您提供丰富、多样的产品功能和服务，当您通过主动选择/上传图文、音频等附件使用本平台产品或服务的功能时，我们会收集您主动提供的文件，同时我们还将为便于您上传文件而经过您的同意后访问您的设备文件读取权限。未经您明示同意，我们不会将前述信息用于其他任何目的，并会全程安全加密处理。
        </p>
        <p>
          3.5.
          当您购买商品和/或服务（购买余额、量大管饱套餐、大航海统计Pro，以下合称“商品”）时，为帮助您完成交易、保障交易安全、提供订单查询、客服及售后服务，我们需要根据商品的类型收集如下部分或全部的订单信息：下单时间、订单编号、订单状态、交易的商品信息、支付信息（下单时间、支付金额、订单编号、支付状态，敏感个人信息）。为保障您的账户和资金安全以及支付服务的安全稳定运行、履行反电信网络诈骗等法定义务，我们还会收集您必要的设备信息（IP地址）并提供给第三方支付渠道。
        </p>
        <p>
          3.6.
          当您使用大航海收件地址统计功能时，您可以选择添加常用收货地址信息（收件人姓名、收件人电话、收件地区、收件地址，敏感个人信息），以便主播自行完成礼物的配送及交付。主播及其委托配送服务的第三方在发货及配送环节不可避免地会收集和使用您的收货地址信息（收件人姓名、收件人电话、收件地区、收件地址，敏感个人信息）。
        </p>
        <p>
          3.7.
          您理解并知悉，随着我们业务的发展，可能会对本平台和服务有所调整变化。原则上，当新功能或服务与发布信息、互动交流、注册认证等场景相关时，收集与使用的个人信息将与原处理目的具有直接或合理关联。在与原处理目的无直接或合理关联的场景下，我们收集、使用您的个人信息，会再次进行告知，并征得您的同意。
        </p>
        <p>3.8. 您充分知悉，在以下情形下，我们收集、使用个人信息无需征得您的授权同意：</p>
        <p>（1） 与国家安全、国防安全有关的；</p>
        <p>（2） 与公共安全、公共卫生、重大公共利益有关的；</p>
        <p>（3） 与犯罪侦查、起诉、审判和判决执行等有关的；</p>
        <p>（4） 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</p>
        <p>（5） 所收集的个人信息是个人信息主体自行向社会公众公开的；</p>
        <p>（6） 从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；</p>
        <p>（7） 根据您的要求签订合同所必需的；</p>
        <p>（8） 用于维护所提供的产品及/或服务的安全稳定运行所必需的，例如发现、处置产品及/或服务的故障；</p>
        <p>（9） 法律法规规定的其他情形。</p>
        <p>四、我们如何使用您的个人信息</p>
        <p>
          4.1.
          我们依据法律法规以及遵循正当、合法、必要的原则而收集和使用您在使用本平台产品或服务过程中主动提供或由于产品或服务需要而产生的个人信息。如果我们欲将您的个人信息用于本隐私政策未载明的其它用途，或基于特定目的将收集而来的信息用于其他目的，我们会及时以合理的方式向您告知，并在使用前再次征得您的同意。
        </p>
        <p>
          4.2.请您注意，对于您在使用我们的服务时所提供的所有个人信息，除非您删除或拒绝我们收集，否则您将在使用服务期间持续授权我们使用。
        </p>
        <p>
          4.3.
          我们收集和使用的您的个人信息类型包括两种：第一种：我们产品/服务的基本业务功能所必需的个人信息：此类个人信息为产品和服务正常运行的必要个人信息，您需授权我们收集。如您拒绝提供，您将无法正常使用我们的产品和服务；第二种：扩展业务功能可能需要收集的个人信息：此个人信息为非基本业务功能所需的个人信息，您可以选择是否授权我们收集。如您拒绝提供，将导致扩展业务功能无法实现或无法达到我们拟达到的效果，但不影响您对基本业务功能的正常使用。
        </p>
        <p>五、我们如何使用Cookie和同类技术</p>
        <p>
          您为了体验更丰富的功能和满足多样化的需求，可以选择使用我们的自动数据收集工具享受相关服务，同时授权我们帮您整理或分析数据。我们不会将上述技术用于本隐私政策所述目的之外的任何用途。请您理解，我们的某些服务只能通过使用上述技术才可得到实现。如您的设备或相关程序允许，您可以通过改变设置，或通过访问提供商的网页，来关闭或删除上述技术。但这一举动可能会影响您使用我们的服务。
        </p>
        <p>六、我们如何共享、转让、公开披露您的个人信息</p>
        <p>共享</p>
        <p>6.1.我们将严格遵守相关法律法规，对您的个人信息予以保密。除以下情况外，我们不会向其他人共享您的个人信息：</p>
        <p>（1）事先获得您明确的同意或授权；</p>
        <p>（2）根据适用的法律法规规定，或基于司法或行政主管部门的强制性要求进行提供；</p>
        <p>
          （3）在法律法规允许的范围内，为维护您或其他用户或其他个人的生命、财产等合法权益或是社会公共利益而有必要提供；
        </p>
        <p>（4）应您的监护人的合法要求而提供您的信息；</p>
        <p>（5）根据与您签署的相关协议或其他的法律文件约定而提供；</p>
        <p>
          （6）我们可能会基于您的相应授权将您的个人信息与我们的关联方共享。但我们只会共享必要的个人信息，且受本隐私政策所述目的之约束。我们的关联方如要改变个人信息的处理目的，将适时向您征得明示同意。
        </p>
        <p>转让</p>
        <p>
          6.2.
          除获取您的明示同意外，我们不会将您的个人信息转让给任何公司、组织或个人。如因合并、收购或破产清算的情形需要转移您的个人信息，我们会向您告知接收方的名称或者姓名，并要求接收方继续受本隐私政策的约束。如接收方变更本隐私政策中约定的个人信息处理目的、处理方式，我们将要求接收方重新获取您的授权同意。
        </p>
        <p>公开披露</p>
        <p>
          6.3.
          除符合法律法规的规定进行公开披露或获得您单独同意外，我们不会公开披露您未自行公开或者其他未合法公开的个人信息。如需公开披露您的个人信息，我们会提前进行个人信息保护影响评估，并采用符合行业内标准的安全保护措施和手段保护您的个人信息安全。
        </p>
        <p>依法豁免征得您的授权同意的情形</p>
        <p>6.4. 在下述情况下，合作方使用，或我们转让、公开披露您的个人信息无需事先征得您的授权同意：</p>
        <p>（1）为订立、履行我们与您签署的合同所必需；</p>
        <p>
          （2）为履行法定职责或者法定义务所必需，例如与国家安全、国防安全、与刑事侦查、起诉、审判和判决执行等直接相关的法定职责或者法定义务；
        </p>
        <p>（3）为应对突发公共卫生事件，或者紧急情况下为保护自然人的生命健康和财产安全所必需；</p>
        <p>（4） 为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；</p>
        <p>（5）依照《个人信息保护法》规定在合理的范围内处理您自行公开或者其他已经合法公开的个人信息；</p>
        <p>（6）法律法规规定的其他情形。</p>
        <p>七、您管理个人信息的权利</p>
        <p>
          我们非常重视您作为个人信息主体所享有的权利，并尽全力保护您对于您个人信息的管理权，以使您有能力了解并保障您的个人信息安全。
        </p>
        <p>7.1. 您可以通过登录您在致唯MultiPost官方网站的账号的【账户详情】来查看和修改您提交的个人信息。</p>
        <p>
          7.2.
          撤回授权/账号注销：如果您提出申请，我们将根据您的意愿和法律规定将您的个人信息删除或进行匿名化处理（但法律法规另有规定或监管部门另有要求的除外，如依据《中华人民共和国网络安全法》规定，您的网络操作日志将至少保留六个月的时间）。
        </p>
        <p>
          7.3.
          为保证您正确身份验证，请及时更新相关信息，以确保它们是准确、最新且完整的，在此过程中如有任何问题，请随时与我们联系。
        </p>
        <p>八、我们对您个人信息的存储与保护</p>
        <p>信息储存</p>
        <p>
          8.1.
          在用户使用我们服务期间，我们会持续保存用户的个人信息。我们承诺将是为了实现我们产品及/或服务目的所必需的最短期限。在超出上述期限后，我们会对您的相关信息进行删除或匿名化处理。
        </p>
        <p>
          8.2.
          您的个人信息将全部被存储于中华人民共和国境内。目前我们不存在向境外提供个人信息的场景。如将来涉及向境外传输个人信息，我们将明确向您告知个人信息出境的目的、接收方、安全保障措施等情况，并另行征得您的同意。
        </p>
        <p>信息保护</p>
        <p>
          8.3.
          您的个人信息安全对于我们至关重要。我们将严格遵守相关法律法规，采取业内认可的合理可行的措施，保护您的个人信息，防止信息遭到未经授权的访问、披露、使用、修改，避免信息损坏或丢失。
        </p>
        <p>
          8.4.
          我们使用符合业界标准的安全防护措施保护您的个人信息，防止遭到未经授权的访问、公开披露、使用、修改，防止发生损坏或丢失。
        </p>
        <p>
          8.5.
          我们通过建立访问控制机制，确保只有授权人员才可以访问个人信息；我们不时举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。一旦发生个人信息安全事件，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议和对您的补救措施，并立即启动应急预案，力求将损失最小化。
        </p>
        <p>九、争议解决</p>
        <p>9.1. 本隐私政策之订立、生效、解释、修订、补充、终止、执行与争议解决，均适用中华人民共和国大陆地区的法律。</p>
        <p>
          9.2.
          您因使用本平台的产品或服务所产生的有关争议，由我们与您协商解决。协商不成时，双方均同意将纠纷或争议提交珠海市香洲区人民法院解决。
        </p>
        <p>9.3. 本隐私政策任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响其余条款的有效性及可执行性。</p>
        <div className="mt-8 rounded-lg bg-gray-50 p-4 dark:bg-gray-800">
          <h2 className="mb-4 text-xl font-semibold">十、联系我们</h2>
          <p className="mb-4">在本隐私政策提及的所有可能需要与我们取得联系的情况下，您可以通过以下方式联系我们：</p>
          <p className="text-gray-600 dark:text-gray-300">官方QQ群：867578227</p>
          <p className="text-gray-600 dark:text-gray-300">电子邮件：support@leaper.one</p>
        </div>
      </div>
    </div>
  );
}
